import { createSlice } from '@reduxjs/toolkit'

export const programsSlice = createSlice({
    name: 'programs',
    initialState: {
        programs:[
            {
                "Pid": 3,
                "Pname": "שעת השיא",
                "PcategoryId": 1,
                "Pprice": 350,
                "PextraPriceForAdditionalScreening": 300,
                "PproductionDate": "2019-01-01T00:00:00",
                "Ptype": "הפעלה",
                "PtargetAudience": "נשים ובנות",
                "Ptime": 1,
                "Pdescription": "הי תכנית קצבית, מגבשת וחוויתית במיוחד, למי שמחפשת אווירה כיפית וקלילה מצד אחד, אך רמה גבוהה ומסר מחזק מצד שני.",
                "PextendedDescription": "פתיחה בפניה לקהל: \"קהל נכבד, נתכבד לפתוח בפניכם את ספר השיאים העולמי.\r\nהשיאים יהיו מתחומים שונים והשמות שיופיעו בספר יהיו מהקהל היושב כאן\"\r\nלאחר הפתיחה מופיעים בזה אחר זה שיאים שונים ומגוונים כשבכל אחד מהם הקהל \r\nמתחרה במשימה מעניינת שבסופה מוכרזת השיאנית הנבחרת.\r\nהפעילויות מאד חוויתיות, סוחפות ומאתגרות.\r\nלאחר מכן מחולקות תעודות לשיאניות השונות ומגיע קטע מעבר עוצמתי המוביל \r\nלמסקנה על תפקידה העיקרי של האישה- התפקיד שלה בתוך הבית.\r\nזהו קטע תוכן קצר שתפקידו להעצים את הפעולות ה\"פשוטות\" שאישה עושה בתוך \r\nביתה\r\nואז מגיע החלק הבא, בו המשתתפות מתחרות על \"שיא אשת החיל\" זהו חידון פומבי \r\nקצר ומהנה מתוך הממלכה של עקרת הבית.\r\nולסיום- קטע אומנותי ומחזק עם תוכן מספרו של הרב פנקוס זצ\"ל ושיר סיום סוחף.\r\nזוהי תכנית קצבית, מגבשת וחוויתית במיוחד, למי שמחפשת אווירה כיפית וקלילה \r\nמצד אחד, אך רמה גבוהה ומסר מחזק מצד שני"
            },
            {
                "Pid": 4,
                "Pname": "אל הכתר",
                "PcategoryId": 2,
                "Pprice": 350,
                "PextraPriceForAdditionalScreening": 300,
                "PproductionDate": "2019-01-02T00:00:00",
                "Ptype": "הפעלה",
                "PtargetAudience": "נשים ובנות",
                "Ptime": 1,
                "Pdescription": "התכנית פעילה וחגיגית כאחד קולעת מאד לבת מצוה! מצד אחד מאד פעילה, חוויתית ומגבשת מצד שני מעניקה לארוע אויירה מרוממת ותוכן יהודי.",
                "PextendedDescription": "במהלך ההפעלה הקהל עובר בליווי המצגת בחדרים שונים בארמון:\r\nמטבח, חדר אוכל, ספריה, ארכיון וחדר מוזיקה\r\nבכל חדר ישנן משימות הקשורות לחדר, הקהל מתחרה במשימות ומוכרזת \r\nהמנצחת באותו חדר. \r\nבסיום כל חדר מזמינים את בת המצווה לתפקיד קצר ומשמעותי הקשור לחדר.\r\nהמעברים מלווים בג'ינגל סוחף, ולסיום דברי חיזוק לבת המצווה מפי הרבנית \r\nקולדצקי ושיר סיום מרגש.\r\nהפעילויות מכבדות וסוחפות את כל הגילאים, כשבין לבין בת המצווה מקבלת \r\nאת מרכז הבמה בתפקידים משמעותיים שיתנו טעם מיוחד לאירוע.\r\nהתכנית מהנה במיוחד, משרה חגיגיות ואווירה יהודית וקולעת מאד לאירוע!"
            },
            {
                "Pid": 5,
                "Pname": "להרגיש",
                "PcategoryId": 3,
                "Pprice": 350,
                "PextraPriceForAdditionalScreening": 300,
                "PproductionDate": "2020-01-01T00:00:00",
                "Ptype": "הפעלה",
                "PtargetAudience": "צוותי הוראה",
                "Ptime": 1,
                "Pdescription": "הפעלה אינטראקטיבית שתעניק התנסות בלתי נשכחת ותותיר את הצוות שלך עם כלים של רגישות והכלה שילכו איתן רחוק.",
                "PextendedDescription": "תוכנית מהממת - לבקש ממילכה גם על זה נושאים ולדעת מה בדיוק לכתוב"
            }
        ]
    },
    reducers: {
        setPrograms: (state, action) => {
            debugger;
            state.programs = action.payload
        },

        clearPrograms: (state) => {
            state.programs = []
        },
    },
})

// Action creators are generated for each case reducer function
export const { setPrograms } = programsSlice.actions

export default programsSlice.reducer